<?php
/**
 * Created by PhpStorm.
 * User: llf
 * Date: 2018/8/13
 * Time: 14:38
 */

/** 特殊需求配置 */
define('DATA_PROCESS', -99);    // 数据权限
define('EXPORT_DATA', -11);    // 导出数据
define('DISPLAY_PHONE', -22);   // 展示客户手机号
return [
    // 客户的相关配置
    'hy_customer' => [
        'source' => [
            1 => '悦美APP',
            2 => '大众点评',
            3 => '京东',
            4 => '客户介绍朋友',
            5 => '员工及介绍朋友',
            6 => '线下落地活动',
            7 => '自然上门',
            8 => '医生自带客',
            9 => '医生代运营',
            10 => '360好医竞价',
            11 => '搜狗好医竞价',
            12 => '百度好医竞价',
            13 => '达人',
            14 => '好医小程序',
            15 => '渠道带客'
        ],
        'level' => [
            1 => '重要',
            2 => '一般',
            3 => '潜在',
            4 => '回收',
            5 => '黑名单',
            6 => '一般(小程序)'
        ],
        'channel' => [
            1 => '杨宏伟',
            2 => '陈彤华',
            3 => '三方网站',
            4 => '其他'
        ]

    ],
    // 部门配置
    'hy_section' => [
        // 部门级别
        'section_level' => [
            1 => '一级部门',
            2 => '二级部门',
            3 => '三级部门'
        ],
        // 一级部门 @todo部门表数据对应
        'top_section' => [
            '1' => '悦美好医万柳店',
            '2' => '悦美好医望京店'
        ],
        //悦美医院id对应部门医院id
        'hos_vs_ids' => [
            '13042' => '1'//悦美好医万柳店
        ],
        //前台用户对应后台咨询师
        'admin_vs_user' => [
            '16'=>'1855',//张千
            '187'=>'1828',//李扬
            '13'=>'1840'//张倩
        ]
    ],
    //预约配置
    'hy_booking' => [
        //预约类型
        'booking_type' => [
            1 => '面诊',
            2 => '手术（局麻）',
            3 => '手术（全麻）',
            4 => '治疗',
            5 => '面诊+手术（局麻）',
            6 => '面诊+手术（全麻）',
            7 => '面诊+治疗',
            8 => '复查'
        ],
        //意向项目
        'booking_part' => [
            1   => '双眼皮',
            2   => '线雕',
            3   => '双眼皮修复',
            4   => '开眼角',
            5   => '祛眼袋',
            6   => '眼袋修复',
            7   => '眼部其他',
            8   => '隆鼻',
            9   => '垫下巴',
            10   => '脂肪填充',
            11  => '面部吸脂',
            12  => '身体吸脂',
            13  => '隆胸',
            14  => '植发',
            15  => '女性私密',
            16  => '手术取出类',
            17  => '手术其他',
            18  => '眼周年轻化',
            19  => '祛斑',
            20  => '肤色不均',
            21  => '面部痤疮',
            22  => '痘坑、痘印（痤疮疤痕）',
            23  => '皮肤松弛下垂',
            24  => '皮肤赘生物',
            25  => '身体减脂紧致',
            26  => '脱毛',
            27  => '红血丝',
            28  => '清洁',
            29  => '阴道紧致（激光）',
            30  => '背部痤疮',
            31  => '水光',
            32  => '乔雅登雅致',
            33  => '乔雅登极致',
            34  => '瑞蓝2',
            35  => '艾莉薇',
            36  => '伊婉',
            37  => '润百颜',
            38  => '海薇',
            39  => '玻尿酸溶解酶',
            40  => '瘦脸针',
            41  => '瘦腿针',
            42  => '除皱针',
            43  => '肉毒其他',
            44  => '纹眉',
            45  => '纹眼线',
            46  => '纹发际线'
        ]
    ],

    // 分诊接待配置
    'hy_reception' => [
        'status' => [ // 分诊接待状态
            1 => '初诊',
            2 => '复诊',
            3 => '复查',
            4 => '再消费',
            5 => '其他'
        ],
        'deal_remark' => [
            1 => '价格问题',
            2 => '时间问题',
            3 => '顾客过来简单了解',
            4 => '顾客家属不同意',
            5 => '顾客担心手术安全',
            6 => '顾客担心手术效果',
            7 => '顾客不信任医生',
            8 => '顾客不信任医院',
            9 => '其他原因'
        ]
    ],
    // 网电咨询配置
    'hy_consult' => [
        'consult_channel' => [1 => '电话咨询', 2 => '网络咨询']
    ],
    // 回访配置
    'hy_visit' => [
        'visit_type' => [
            1 => '术前回访',
            2 => '术后回访',
            3 => '未到院回访',
            4 => '未成交回访',
            5 => '术后复查',
            6 => '术后调查',
            7 => '投诉回访',
            8 => '活动回访',
            9 => '其他'
        ]
    ],

    // 特殊权限需求配置
    'special_process' => [
        ['id' => DATA_PROCESS, 'text' => '数据权限', 'p_id' => 0],
        ['id' => EXPORT_DATA, 'text' => '导出数据', 'p_id' => DATA_PROCESS],
        ['id' => DISPLAY_PHONE, 'text' => '显示客户手机号', 'p_id' => DATA_PROCESS],
    ],
    // 不走权限控制的一些方法
    'allow_action' => [
        'order/getordergoods',
        'coupons/ajaxgetclient',
        'coupons/couponslist',
        'coupons/coupondetail',
        'coupons/couponusedetail',
        'coupons/delcoupon',
        'customer/selectCustomer',
        'booking/bookingShow',
        'booking/addBooking',
        'booking/doctorrotalist',
        'booking/doctorRotaEdit',
        'booking/getRotaList',
        'booking/rotaEdit',
        'customer/detailwithcheck',
        'customer/detail4Reception',
        'index/index',
    ]
];